In [2]:
# Perform the following operations using R/Python on suitable data sets: 

# a)  read data from different formats (like csv, xls) 
# b)  Find Shape of Data 
# c)  Find Missing Values 
# d)  Find data type of each column 
# e)  Finding out Zero's 
# f)  Indexing and selecting data, sort data, 
# g)  Describe attributes of data, checking data types of each column, 
# h)  counting unique values of data, format of each column, converting variable 
# data type (e.g. from long to short, vice versa)

In [4]:
#  Importing Libraries

import numpy as np
import pandas as pd

In [6]:
# a) read data from different formats (like csv, xls) 

dataset = pd.read_csv("./Customers.csv")

In [8]:
dataset.head()         # printing the first 5 rows

,CustomerID,Gender,Age,Annual Income ($),Spending Score (1-100),Profession,Work Experience,Family Size
0,1,Male,19,15000,39,Healthcare,1,4
1,2,Male,21,35000,81,Engineer,3,3
2,3,Female,20,86000,6,Engineer,1,1
3,4,Female,23,59000,77,Lawyer,0,2
4,5,Female,31,38000,40,Entertainment,2,6

In [10]:
# b) Find Shape of Data 

dataset.shape   #gives the total number of rows and columns

(2000, 8)

In [12]:
# c)  Find Missing Values 

dataset.isnull()     # Represents the Boolean value: True if there are any null values, False otherwise

,CustomerID,Gender,Age,Annual Income ($),Spending Score (1-100),Profession,Work Experience,Family Size
0,False,False,False,False,False,False,False,False
1,False,False,False,False,False,False,False,False
2,False,False,False,False,False,False,False,False
3,False,False,False,False,False,False,False,False
4,False,False,False,False,False,False,False,False
...,...,...,...,...,...,...,...,...
1995,False,False,False,False,False,False,False,False
1996,False,False,False,False,False,False,False,False
1997,False,False,False,False,False,False,False,False
1998,False,False,False,False,False,False,False,False
1999,False,False,False,False,False,False,False,False

In [14]:
dataset.isnull().values.any()     # Shows true means there are some null value in our dataset

True

In [16]:
dataset.isnull().sum()    # Shows the count of null value with repect ot columns

CustomerID                 0
Gender                     0
Age                        0
Annual Income ($)          0
Spending Score (1-100)     0
Profession                35
Work Experience            0
Family Size                0
dtype: int64

In [18]:
# Handling the null values by dropping the column (string type)

dataset_ds = dataset.drop(columns=["Profession"])

In [20]:
dataset_ds.isnull().sum()

CustomerID                0
Gender                    0
Age                       0
Annual Income ($)         0
Spending Score (1-100)    0
Work Experience           0
Family Size               0
dtype: int64

In [22]:
# d)  Find data type of each column

dataset_ds.dtypes

CustomerID                 int64
Gender                    object
Age                        int64
Annual Income ($)          int64
Spending Score (1-100)     int64
Work Experience            int64
Family Size                int64
dtype: object

In [24]:
# e)  Finding out Zero's 

has_zero = (dataset_ds == 0).values.any()
has_zero                                               # Shows true means there are some zero's present in our dataset

True

In [26]:
zero_counts = (dataset_ds == 0).sum()
zero_counts                                           # Shows number of zero's present in each column

CustomerID                  0
Gender                      0
Age                        24
Annual Income ($)           2
Spending Score (1-100)      2
Work Experience           431
Family Size                 0
dtype: int64

In [28]:
dataset_ds['Age'] = dataset_ds['Age'].replace(0, dataset_ds['Age'].mean())
(dataset_ds == 0).sum()             

# As the Age cannot be zero so we need to handle this by replacing zero's by mean/ median of that of column

CustomerID                  0
Gender                      0
Age                         0
Annual Income ($)           2
Spending Score (1-100)      2
Work Experience           431
Family Size                 0
dtype: int64

In [30]:
dataset_ds['Age'].info()

<class 'pandas.core.series.Series'>
RangeIndex: 2000 entries, 0 to 1999
Series name: Age
Non-Null Count  Dtype
--------------  -----
2000 non-null   float64
dtypes: float64(1)
memory usage: 15.8 KB

In [32]:
# f)  Indexing and selecting data, sort data, 

dataset_ds.iloc[0]            # Selects the first row

CustomerID                    1
Gender                     Male
Age                        19.0
Annual Income ($)         15000
Spending Score (1-100)       39
Work Experience               1
Family Size                   4
Name: 0, dtype: object

In [34]:
dataset_ds.iloc[2:6]          # Selects the rows from 2 to 5

,CustomerID,Gender,Age,Annual Income ($),Spending Score (1-100),Work Experience,Family Size
2,3,Female,20.0,86000,6,1,1
3,4,Female,23.0,59000,77,0,2
4,5,Female,31.0,38000,40,2,6
5,6,Female,22.0,58000,76,0,2

In [36]:
# Sorting the data using Age column

dataset_ds['Age']

0       19.0
1       21.0
2       20.0
3       23.0
4       31.0
        ...
1995    71.0
1996    91.0
1997    87.0
1998    77.0
1999    90.0
Name: Age, Length: 2000, dtype: float64

In [38]:
sorted_ds = dataset_ds.sort_values(by="Age", ascending= False)
sorted_ds.head(10)

,CustomerID,Gender,Age,Annual Income ($),Spending Score (1-100),Work Experience,Family Size
1103,1104,Female,99.0,103706,50,1,2
1524,1525,Female,99.0,150782,18,8,2
1629,1630,Male,99.0,162762,52,1,1
361,362,Male,99.0,63364,61,1,2
1322,1323,Female,99.0,144176,74,7,2
1771,1772,Female,99.0,84167,46,10,7
1188,1189,Female,99.0,122548,14,2,5
1401,1402,Male,99.0,139685,20,1,4
1133,1134,Female,99.0,57677,99,0,5
351,352,Male,99.0,173394,4,13,1

In [40]:
# g)  Describe attributes of data, checking data types of each column, 

dataset_ds.info()     # provide all the information about the datset including the number of columns, data entries, non null counts etc

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2000 entries, 0 to 1999
Data columns (total 7 columns):
 #   Column                  Non-Null Count  Dtype
---  ------                  --------------  -----
 0   CustomerID              2000 non-null   int64
 1   Gender                  2000 non-null   object
 2   Age                     2000 non-null   float64
 3   Annual Income ($)       2000 non-null   int64
 4   Spending Score (1-100)  2000 non-null   int64
 5   Work Experience         2000 non-null   int64
 6   Family Size             2000 non-null   int64
dtypes: float64(1), int64(5), object(1)
memory usage: 109.5+ KB

In [42]:
dataset_ds.describe()     # prvoides the summary statistics for all numerical columns

,CustomerID,Age,Annual Income ($),Spending Score (1-100),Work Experience,Family Size
count,2000.000000,2000.000000,2000.000000,2000.000000,2000.000000,2000.000000
mean,1000.500000,49.547520,110731.821500,50.962500,4.102500,3.768500
std,577.494589,27.912825,45739.536688,27.934661,3.922204,1.970749
min,1.000000,1.000000,0.000000,0.000000,0.000000,1.000000
25%,500.750000,26.000000,74572.000000,28.000000,1.000000,2.000000
50%,1000.500000,48.960000,110045.000000,50.000000,3.000000,4.000000
75%,1500.250000,73.000000,149092.750000,75.000000,7.000000,5.000000
max,2000.000000,99.000000,189974.000000,100.000000,17.000000,9.000000

In [44]:
dataset_ds.dtypes           # datatype of each column

CustomerID                  int64
Gender                     object
Age                       float64
Annual Income ($)           int64
Spending Score (1-100)      int64
Work Experience             int64
Family Size                 int64
dtype: object

In [46]:
# h)  counting unique values of data, format of each column, converting variable 
# data type (e.g. from long to short, vice versa) 

unique_counts = dataset_ds['Age'].value_counts()
unique_counts                       # Counts the frequency of each unique value

Age
31.0    31
32.0    30
52.0    30
91.0    29
63.0    28
        ..
42.0    12
10.0    12
77.0    12
71.0    12
98.0     9
Name: count, Length: 100, dtype: int64

In [48]:
unique_counts = dataset_ds['Gender'].value_counts()
unique_counts                          # Counts the frequency of each unique value

Gender
Female    1186
Male       814
Name: count, dtype: int64

In [50]:
dataset_ds.nunique()          # counts the the total numbers of unique value for each column

CustomerID                2000
Gender                       2
Age                        100
Annual Income ($)         1786
Spending Score (1-100)     101
Work Experience             18
Family Size                  9
dtype: int64

In [52]:
dataset_ds.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2000 entries, 0 to 1999
Data columns (total 7 columns):
 #   Column                  Non-Null Count  Dtype
---  ------                  --------------  -----
 0   CustomerID              2000 non-null   int64
 1   Gender                  2000 non-null   object
 2   Age                     2000 non-null   float64
 3   Annual Income ($)       2000 non-null   int64
 4   Spending Score (1-100)  2000 non-null   int64
 5   Work Experience         2000 non-null   int64
 6   Family Size             2000 non-null   int64
dtypes: float64(1), int64(5), object(1)
memory usage: 109.5+ KB

In [54]:
# Converting the datatype

dataset_ds['Work Experience'] = dataset_ds['Work Experience'].astype('int32')
dataset_ds.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2000 entries, 0 to 1999
Data columns (total 7 columns):
 #   Column                  Non-Null Count  Dtype
---  ------                  --------------  -----
 0   CustomerID              2000 non-null   int64
 1   Gender                  2000 non-null   object
 2   Age                     2000 non-null   float64
 3   Annual Income ($)       2000 non-null   int64
 4   Spending Score (1-100)  2000 non-null   int64
 5   Work Experience         2000 non-null   int32
 6   Family Size             2000 non-null   int64
dtypes: float64(1), int32(1), int64(4), object(1)
memory usage: 101.7+ KB